# 我方为白棋，在敌方5手n打，n打数量超过对应值时，不进行三手交换
# 反之 若对方给点很多 我们则更容易找出 不好的点 就无需交换

three_greater_swap = {
    '112,128,144': 0,   # 长星局
    '112,128,143': 225, # 峡月局
    '112,128,142': 5,   # 恒星局
    '112,128,141': 225, # 水月局
    '112,128,140': 0,   # 流星局
    '112,128,127': 5,   # 云月局
    '112,128,126': 4,   # 浦月局
    '112,128,125': 225, # 岚月局
    '112,128,111': 225, # 银月局
    '112,128,110': 2,   # 明星局
    '112,128,96': 2,    # 斜月局
    '112,128,95': 3,    # 名月局
    '112,128,80': 225,  # 彗星局
    '112,113,114': 6,   # 寒星局
    '112,113,129': 13,  # 溪月局
    '112,113,144': 1,   # 疏星局
    '112,113,128': 14,  # 花月局
    '112,113,143': 5,   # 残月局
    '112,113,127': 11,  # 雨月局
    '112,113,142': 5,   # 金星局
    '112,113,111': 6,   # 松月局
    '112,113,126': 3,   # 丘月局
    '112,113,141': 19,  # 新月局
    '112,113,110': 1,   # 瑞星局
    '112,113,125': 4,   # 山月局
    '112,113,140': 0    # 游星局

}


def get_three_swap_or_not(act1: int, act2: int, act3: int, n_play: int) -> bool:
    m_str = str(act1) + "," + str(act2) + "," + str(act3)
    # print(n_play)
    flag_nums = three_greater_swap[m_str]

    if n_play <= flag_nums:
        print(f"黑方5手n打数量{n_play}过少，我方白方ai选择三手交换")
        return True
    return False


# x = input()
# a = int(x) % 15
# b = 14-int(x) // 15
# print(a*15+b)

"""
#  测试 get_three_swap_or_not
for key in three_greater_swap:
    value = three_greater_swap[key]
    acts = key.split(',')
    print(get_three_swap_or_not(acts[0], acts[1], acts[2], value - 1))

# 结论 ： 正确 黑棋打点少于指定值 就三手交换
"""

